mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
/*
 * Copyright 2020-2024 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "sdkconfig.h"
#if defined(CONFIG_NIMBLE_ENABLED)

#include "BLEDevice.h"
#include "BLEUtils.h"

#include "esp_err.h"
#ifndef CONFIG_IDF_TARGET_ESP32P4
#include "esp_bt.h"
#endif
#include "nvs_flash.h"
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0) || CONFIG_BT_NIMBLE_LEGACY_VHCI_ENABLE)
#include "esp_nimble_hci.h"
#endif
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/ble_hs_pvcy.h"
#include "host/util/util.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"

#include "esp32-hal-bt.h"

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
#include "BLEClient.h"
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
#include "BLEServer.h"
#endif

static const char *LOG_TAG = "BLEDevice";

extern "C" void ble_store_config_init(void);

/**
 * Singletons for the BLEDevice.
 */
#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
BLEScan *BLEDevice::m_pScan = nullptr;
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
BLEServer *BLEDevice::m_pServer = nullptr;
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
#if CONFIG_BT_NIMBLE_EXT_ADV
BLEExtAdvertising *BLEDevice::m_bleAdvertising = nullptr;
#else
BLEAdvertising *BLEDevice::m_bleAdvertising = nullptr;
#endif
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
std::array<BLEClient *, NIMBLE_MAX_CONNECTIONS> BLEDevice::m_pClients{nullptr};
#endif

bool BLEDevice::m_initialized{false};
uint32_t BLEDevice::m_passkey{123456};
bool BLEDevice::m_synced{false};
ble_gap_event_listener BLEDevice::m_listener{};
std::vector<BLEAddress> BLEDevice::m_whiteList{};
uint8_t BLEDevice::m_ownAddrType{BLE_OWN_ADDR_PUBLIC};

#ifdef CONFIG_BTDM_BLE_SCAN_DUPL
uint16_t BLEDevice::m_scanDuplicateSize{CONFIG_BTDM_SCAN_DUPL_CACHE_SIZE};
uint8_t BLEDevice::m_scanFilterMode{CONFIG_BTDM_SCAN_DUPL_TYPE};
#endif

/* -------------------------------------------------------------------------- */
/*                              SERVER FUNCTIONS                              */
/* -------------------------------------------------------------------------- */

#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
/**
 * @brief Create an instance of a server.
 * @return A pointer to the instance of the server.
 */
BLEServer *BLEDevice::createServer() {
  if (BLEDevice::m_pServer == nullptr) {
    BLEDevice::m_pServer = new BLEServer();
    ble_gatts_reset();
    ble_svc_gap_init();
    ble_svc_gatt_init();
  }

  return m_pServer;
}  // createServer

/**
 * @brief Get the instance of the server.
 * @return A pointer to the server instance or nullptr if none have been created.
 */
BLEServer *BLEDevice::getServer() {
  return m_pServer;
}  // getServer
#endif  // #if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)

/* -------------------------------------------------------------------------- */
/*                            ADVERTISING FUNCTIONS                           */
/* -------------------------------------------------------------------------- */

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Get the instance of the extended advertising object.
 * @return A pointer to the extended advertising object.
 */
BLEExtAdvertising *BLEDevice::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new BLEExtAdvertising();
  }

  return m_bleAdvertising;
}

/**
 * @brief Convenience function to begin advertising.
 * @param [in] instId The extended advertisement instance ID to start.
 * @param [in] duration How long to advertise for in milliseconds, 0 = forever (default).
 * @param [in] maxEvents Maximum number of advertisement events to send, 0 = no limit (default).
 * @return True if advertising started successfully.
 */
bool BLEDevice::startAdvertising(uint8_t instId, int duration, int maxEvents) {
  return getAdvertising()->start(instId, duration, maxEvents);
}  // startAdvertising

/**
 * @brief Convenience function to stop advertising a data set.
 * @param [in] instId The extended advertisement instance ID to stop advertising.
 * @return True if advertising stopped successfully.
 */
bool BLEDevice::stopAdvertising(uint8_t instId) {
  return getAdvertising()->stop(instId);
}  // stopAdvertising
#endif

#if !CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Get the instance of the advertising object.
 * @return A pointer to the advertising object.
 */
BLEAdvertising *BLEDevice::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new BLEAdvertising();
  }
  return m_bleAdvertising;
}

/**
 * @brief Convenience function to begin advertising.
 * @param [in] duration The duration in milliseconds to advertise for, default = forever.
 * @return True if advertising started successfully.
 */
bool BLEDevice::startAdvertising(uint32_t duration) {
  return getAdvertising()->start(duration);
}  // startAdvertising
#endif

/**
 * @brief Convenience function to stop all advertising.
 * @return True if advertising stopped successfully.
 */
bool BLEDevice::stopAdvertising() {
  return getAdvertising()->stop();
}  // stopAdvertising
#endif  // #if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)

/* -------------------------------------------------------------------------- */
/*                               SCAN FUNCTIONS                               */
/* -------------------------------------------------------------------------- */

/**
 * @brief Retrieve the Scan object that we use for scanning.
 * @return The scanning object reference.  This is a singleton object.  The caller should not
 * try and release/delete it.
 */
#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
BLEScan *BLEDevice::getScan() {
  if (m_pScan == nullptr) {
    m_pScan = new BLEScan();
  }

  return m_pScan;
}  // getScan

