mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
#ifdef CONFIG_BTDM_BLE_SCAN_DUPL
/**
 * @brief Set the duplicate filter cache size for filtering scanned devices.
 * @param [in] size The number of advertisements filtered before the cache is reset.\n
 * Range is 10-1000, a larger value will reduce how often the same devices are reported.
 * @details Must only be called before calling BLEDevice::init.
 */
void BLEDevice::setScanDuplicateCacheSize(uint16_t size) {
  if (m_initialized) {
    log_e(LOG_TAG, "Cannot change scan cache size while initialized");
    return;
  } else {
    if (size > 1000) {
      size = 1000;
    } else if (size < 10) {
      size = 10;
    }
  }

  log_d(LOG_TAG, "Set duplicate cache size to: %u", size);
  m_scanDuplicateSize = size;
}

/**
 * @brief Set the duplicate filter mode for filtering scanned devices.
 * @param [in] mode One of three possible options:
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DEVICE (0) (default)\n
     Filter by device address only, advertisements from the same address will be reported only once.
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DATA (1)\n
     Filter by data only, advertisements with the same data will only be reported once,\n
     even from different addresses.
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DATA_DEVICE (2)\n
     Filter by address and data, advertisements from the same address will be reported only once,\n
     except if the data in the advertisement has changed, then it will be reported again.
 * @details Must only be called before calling BLEDevice::init.
 */
void BLEDevice::setScanFilterMode(uint8_t mode) {
  if (m_initialized) {
    log_e(LOG_TAG, "Cannot change scan duplicate type while initialized");
    return;
  } else if (mode > 2) {
    log_e(LOG_TAG, "Invalid scan duplicate type");
    return;
  }

  m_scanFilterMode = mode;
}
#endif  // CONFIG_BTDM_BLE_SCAN_DUPL
#endif  // #if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)

/* -------------------------------------------------------------------------- */
/*                              CLIENT FUNCTIONS                              */
/* -------------------------------------------------------------------------- */

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
/**
 * @brief Creates a new client object, each client can connect to 1 peripheral device.
 * @return A pointer to the new client object, or nullptr on error.
 */
BLEClient *BLEDevice::createClient() {
  return createClient(BLEAddress{});
}  // createClient

/**
 * @brief Creates a new client object, each client can connect to 1 peripheral device.
 * @param [in] peerAddress A peer address reference that is copied to the new client
 * object, allows for calling BLEClient::connect(bool) without a device or address parameter.
 * @return A pointer to the new client object, or nullptr on error.
 */
BLEClient *BLEDevice::createClient(const BLEAddress &peerAddress) {
  for (auto &clt : m_pClients) {
    if (clt == nullptr) {
      clt = new BLEClient(peerAddress);
      return clt;
    }
  }

  log_e(LOG_TAG, "Unable to create client; already at max: %d", NIMBLE_MAX_CONNECTIONS);
  return nullptr;
}  // createClient

/**
 * @brief Delete the client object and remove it from the list.\n
 * Checks if it is connected or trying to connect and disconnects/stops it first.
 * @param [in] pClient A pointer to the client object.
 */
bool BLEDevice::deleteClient(BLEClient *pClient) {
  if (pClient == nullptr) {
    return false;
  }

  for (auto &clt : m_pClients) {
    if (clt == pClient) {
      if (clt->isConnected()) {
        clt->m_config.deleteOnDisconnect = true;
        if (!clt->disconnect()) {
          break;
        }
      } else if (pClient->m_pTaskData != nullptr) {
        clt->m_config.deleteOnConnectFail = true;
        if (!clt->cancelConnect()) {
          break;
        }
      } else {
        delete clt;
        clt = nullptr;
      }

      return true;
    }
  }

  return false;
}  // deleteClient

/**
 * @brief Get the number of created client objects.
 * @return Number of client objects created.
 */
size_t BLEDevice::getCreatedClientCount() {
  size_t count = 0;
  for (const auto clt : m_pClients) {
    if (clt != nullptr) {
      count++;
    }
  }

  return count;
}  // getCreatedClientCount

/**
 * @brief Get a reference to a client by connection handle.
 * @param [in] connHandle The client connection handle to search for.
 * @return A pointer to the client object with the specified connection handle or nullptr.
 */
BLEClient *BLEDevice::getClientByHandle(uint16_t connHandle) {
  for (const auto clt : m_pClients) {
    if (clt != nullptr && clt->getConnHandle() == connHandle) {
      return clt;
    }
  }

  return nullptr;
}  // getClientByHandle

/**
 * @brief Get a reference to a client by peer address.
 * @param [in] addr The address of the peer to search for.
 * @return A pointer to the client object with the peer address or nullptr.
 */
BLEClient *BLEDevice::getClientByPeerAddress(const BLEAddress &addr) {
  for (const auto clt : m_pClients) {
    if (clt != nullptr && clt->getPeerAddress() == addr) {
      return clt;
    }
  }

  return nullptr;
}  // getClientPeerAddress

/**
 * @brief Finds the first disconnected client available.
 * @return A pointer to the first client object that is not connected to a peer or nullptr.
 */
BLEClient *BLEDevice::getDisconnectedClient() {
  for (const auto clt : m_pClients) {
    if (clt != nullptr && !clt->isConnected()) {
      return clt;
    }
  }

  return nullptr;
}  // getDisconnectedClient

/**
 * @brief Get a list of connected clients.
 * @return A vector of connected client objects.
 */
std::vector<BLEClient *> BLEDevice::getConnectedClients() {
  std::vector<BLEClient *> clients;
  for (const auto clt : m_pClients) {
    if (clt != nullptr && clt->isConnected()) {
      clients.push_back(clt);
    }
  }

  return clients;
}  // getConnectedClients

#endif  // #if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)

/* -------------------------------------------------------------------------- */
/*                               TRANSMIT POWER                               */
/* -------------------------------------------------------------------------- */

