mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
#ifndef CONFIG_IDF_TARGET_ESP32P4
/**
 * @brief Get the transmission power.
 * @return The power level currently used in esp_power_level_t or a negative value on error.
 */
esp_power_level_t BLEDevice::getPowerLevel(esp_ble_power_type_t powerType) {
  esp_power_level_t pwr = esp_ble_tx_power_get(powerType);

#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32S3)
  // workaround for bug when "enhanced tx power" was added
  if (pwr == 0xFF) {
    pwr = esp_ble_tx_power_get(ESP_BLE_PWR_TYPE_CONN_HDL3);
  }
#endif

  return pwr;
}  // getPowerLevel

/**
 * @brief Set the transmission power.
 * @param [in] powerLevel The power level to set in esp_power_level_t.
 * @return True if the power level was set successfully.
 */
bool BLEDevice::setPowerLevel(esp_power_level_t powerLevel, esp_ble_power_type_t powerType) {
  esp_err_t errRc = esp_ble_tx_power_set(powerType, powerLevel);
  if (errRc != ESP_OK) {
    log_e(LOG_TAG, "esp_ble_tx_power_set: rc=%d", errRc);
  }

  return errRc == ESP_OK;
}  // setPowerLevel
#endif  // !CONFIG_IDF_TARGET_ESP32P4

/**
 * @brief Set the transmission power.
 * @param [in] dbm The power level to set in dBm.
 * @return True if the power level was set successfully.
 */
bool BLEDevice::setPower(int8_t dbm, BLETxPowerType type) {
#ifdef CONFIG_IDF_TARGET_ESP32P4
  return false;  // CONFIG_IDF_TARGET_ESP32P4 does not support esp_ble_tx_power_set
#else
  if (dbm % 3 == 2) {
    dbm++;  // round up to the next multiple of 3 to be able to target 20dbm
  }

  bool success = false;
  esp_power_level_t espPwr = static_cast<esp_power_level_t>(dbm / 3 + ESP_PWR_LVL_N0);
  if (type == BLETxPowerType::All) {
    success = setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_ADV);
    success &= setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_SCAN);
    success &= setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_DEFAULT);
  } else if (type == BLETxPowerType::Advertise) {
    success = setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_ADV);
  } else if (type == BLETxPowerType::Scan) {
    success = setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_SCAN);
  } else if (type == BLETxPowerType::Connection) {
    success = setPowerLevel(espPwr, ESP_BLE_PWR_TYPE_DEFAULT);
  }

  return success;
#endif
}  // setPower

/**
 * @brief Get the transmission power.
 * @return The power level currently used in dbm or 0xFF on error.
 */
int BLEDevice::getPower(BLETxPowerType type) {
#ifdef CONFIG_IDF_TARGET_ESP32P4
  return 0xFF;  // CONFIG_IDF_TARGET_ESP32P4 does not support esp_ble_tx_power_get
#else
  esp_ble_power_type_t espPwr = type == BLETxPowerType::Advertise ? ESP_BLE_PWR_TYPE_ADV
                                : type == BLETxPowerType::Scan    ? ESP_BLE_PWR_TYPE_SCAN
                                                                  : ESP_BLE_PWR_TYPE_DEFAULT;

  int pwr = getPowerLevel(espPwr);
  if (pwr < 0) {
    log_e(LOG_TAG, "esp_ble_tx_power_get failed rc=%d", pwr);
    return 0xFF;
  }

  if (pwr < ESP_PWR_LVL_N0) {
    return -3 * (ESP_PWR_LVL_N0 - pwr);
  }

  if (pwr > ESP_PWR_LVL_N0) {
    return std::min<int>((pwr - ESP_PWR_LVL_N0) * 3, 20);
  }

  return 0;
#endif
}  // getPower

/* -------------------------------------------------------------------------- */
/*                                MTU FUNCTIONS                               */
/* -------------------------------------------------------------------------- */

/**
 * @brief Setup local mtu that will be used to negotiate mtu during request from client peer.
 * @param [in] mtu Value to set local mtu:
 * * This should be larger than 23 and lower or equal to BLE_ATT_MTU_MAX = 527.
 * @return True if the mtu was set successfully.
 */
bool BLEDevice::setMTU(uint16_t mtu) {
  int rc = ble_att_set_preferred_mtu(mtu);
  if (rc != 0) {
    log_e(LOG_TAG, "Could not set local mtu value to: %d, rc: %d", mtu, rc);
  }

  return rc == 0;
}  // setMTU

/**
 * @brief Get local MTU value set.
 * @return The current preferred MTU setting.
 */
uint16_t BLEDevice::getMTU() {
  return ble_att_preferred_mtu();
}

/* -------------------------------------------------------------------------- */
/*                               BOND MANAGEMENT                              */
/* -------------------------------------------------------------------------- */

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL) || defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
/**
 * @brief Gets the number of bonded peers stored
 */
int BLEDevice::getNumBonds() {
  ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
  int num_peers, rc;
  rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
  if (rc != 0) {
    return 0;
  }

  return num_peers;
}

/**
 * @brief Deletes all bonding information.
 * @returns True on success.
 */
bool BLEDevice::deleteAllBonds() {
  int rc = ble_store_clear();
  if (rc != 0) {
    log_e(LOG_TAG, "Failed to delete all bonds; rc=%d", rc);
    return false;
  }
  return true;
}

/**
 * @brief Deletes a peer bond.
 * @param [in] address The address of the peer with which to delete bond info.
 * @returns True on success.
 */
bool BLEDevice::deleteBond(const BLEAddress &address) {
  return ble_gap_unpair(address.getBase()) == 0;
}

/**
 * @brief Checks if a peer device is bonded.
 * @param [in] address The address to check for bonding.
 * @returns True if bonded.
 */
bool BLEDevice::isBonded(const BLEAddress &address) {
  ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
  int num_peers, rc;

  rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
  if (rc != 0) {
    return false;
  }

  for (int i = 0; i < num_peers; i++) {
    BLEAddress storedAddr(peer_id_addrs[i]);
    if (storedAddr == address) {
      return true;
    }
  }

  return false;
}

/**
 * @brief Get the address of a bonded peer device by index.
 * @param [in] index The index to retrieve the peer address of.
 * @returns BLEAddress of the found bonded peer or null address if not found.
 */
BLEAddress BLEDevice::getBondedAddress(int index) {
  ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
  int num_peers, rc;
  rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
  if (rc != 0 || index > num_peers || index < 0) {
    return BLEAddress{};
  }

  return BLEAddress(peer_id_addrs[index]);
}
#endif

