mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
/* -------------------------------------------------------------------------- */
/*                                  WHITELIST                                 */
/* -------------------------------------------------------------------------- */

/**
 * @brief Checks if a peer device is whitelisted.
 * @param [in] address The address to check for in the whitelist.
 * @returns True if the address is in the whitelist.
 */
bool BLEDevice::onWhiteList(const BLEAddress &address) {
  for (const auto &addr : m_whiteList) {
    if (addr == address) {
      return true;
    }
  }

  return false;
}

/**
 * @brief Add a peer address to the whitelist.
 * @param [in] address The address to add to the whitelist.
 * @returns True if successful.
 */
bool BLEDevice::whiteListAdd(const BLEAddress &address) {
  if (!BLEDevice::onWhiteList(address)) {
    m_whiteList.push_back(address);
    int rc = ble_gap_wl_set(reinterpret_cast<ble_addr_t *>(&m_whiteList[0]), m_whiteList.size());
    if (rc != 0) {
      log_e(LOG_TAG, "Failed adding to whitelist rc=%d", rc);
      m_whiteList.pop_back();
      return false;
    }
  }

  return true;
}

/**
 * @brief Remove a peer address from the whitelist.
 * @param [in] address The address to remove from the whitelist.
 * @returns True if successful.
 */
bool BLEDevice::whiteListRemove(const BLEAddress &address) {
  for (auto it = m_whiteList.begin(); it < m_whiteList.end(); ++it) {
    if (*it == address) {
      m_whiteList.erase(it);
      int rc = ble_gap_wl_set(reinterpret_cast<ble_addr_t *>(&m_whiteList[0]), m_whiteList.size());
      if (rc != 0) {
        m_whiteList.push_back(address);
        log_e(LOG_TAG, "Failed removing from whitelist rc=%d", rc);
        return false;
      }

      std::vector<BLEAddress>(m_whiteList).swap(m_whiteList);
    }
  }

  return true;
}

/**
 * @brief Gets the count of addresses in the whitelist.
 * @returns The number of addresses in the whitelist.
 */
size_t BLEDevice::getWhiteListCount() {
  return m_whiteList.size();
}

/**
 * @brief Gets the address at the vector index.
 * @param [in] index The vector index to retrieve the address from.
 * @returns The BLEAddress at the whitelist index or null address if not found.
 */
BLEAddress BLEDevice::getWhiteListAddress(size_t index) {
  if (index > m_whiteList.size()) {
    log_e(LOG_TAG, "Invalid index; %u", index);
    return BLEAddress{};
  }

  return m_whiteList[index];
}

/* -------------------------------------------------------------------------- */
/*                               STACK FUNCTIONS                              */
/* -------------------------------------------------------------------------- */

#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Set the preferred default phy to use for connections.
 * @param [in] txPhyMask TX PHY. Can be mask of following:
 * - BLE_GAP_LE_PHY_1M_MASK
 * - BLE_GAP_LE_PHY_2M_MASK
 * - BLE_GAP_LE_PHY_CODED_MASK
 * - BLE_GAP_LE_PHY_ANY_MASK
 * @param [in] rxPhyMask RX PHY. Can be mask of following:
 * - BLE_GAP_LE_PHY_1M_MASK
 * - BLE_GAP_LE_PHY_2M_MASK
 * - BLE_GAP_LE_PHY_CODED_MASK
 * - BLE_GAP_LE_PHY_ANY_MASK
 * @return True if successful.
 */
bool BLEDevice::setDefaultPhy(uint8_t txPhyMask, uint8_t rxPhyMask) {
  int rc = ble_gap_set_prefered_default_le_phy(txPhyMask, rxPhyMask);
  if (rc != 0) {
    log_e(LOG_TAG, "Failed to set default phy; rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
  }

  return rc == 0;
}
#endif

/**
 * @brief Host reset, we pass the message so we don't make calls until re-synced.
 * @param [in] reason The reason code for the reset.
 */
void BLEDevice::onReset(int reason) {
  if (!m_synced) {
    return;
  }

  m_synced = false;

  log_e(LOG_TAG, "Host reset; reason=%d, %s", reason, BLEUtils::returnCodeToString(reason));
}  // onReset

/**
 * @brief Host synced with controller, all clear to make calls to the stack.
 */
void BLEDevice::onSync(void) {
  log_i(LOG_TAG, "NimBle host synced.");
  // This check is needed due to potentially being called multiple times in succession
  // If this happens, the call to scan start may get stuck or cause an advertising fault.
  if (m_synced) {
    return;
  }

  // Get the public and random address for the device.
  int rc = ble_hs_util_ensure_addr(0);
  if (rc == 0) {
    rc = ble_hs_util_ensure_addr(1);
  }

  if (rc != 0) {
    log_e(LOG_TAG, "error ensuring address; rc=%d", rc);
    return;
  }

  // start with using the public address if available, if not then use random.
  rc = ble_hs_id_copy_addr(BLE_OWN_ADDR_PUBLIC, NULL, NULL);
  if (rc != 0) {
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
  }

  // Yield for housekeeping tasks before returning to operations.
  // Occasionally triggers exception without.
  ble_npl_time_delay(1);

  m_synced = true;

  if (m_initialized) {
#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
    if (m_pScan != nullptr) {
      m_pScan->onHostSync();
    }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
    if (m_bleAdvertising != nullptr) {
      m_bleAdvertising->onHostSync();
    }
#endif
  }
}  // onSync

/**
 * @brief The main host task.
 */
void BLEDevice::host_task(void *param) {
  log_i(LOG_TAG, "BLE Host Task Started");
  nimble_port_run();  // This function will return only when nimble_port_stop() is executed
  nimble_port_freertos_deinit();
}  // host_task

/**
 * @brief Initialize the BLE environment.
 * @param [in] deviceName The device name of the device.
 */
bool BLEDevice::init(const std::string &deviceName) {
  if (!m_initialized) {
    // make sure the linker includes esp32-hal-bt.c so Arduino init doesn't release BLE memory.
    btStarted();

    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      err = nvs_flash_erase();
      if (err == ESP_OK) {
        err = nvs_flash_init();
      }
    }

    if (err != ESP_OK) {
      log_e(LOG_TAG, "nvs_flash_init() failed; err=%d", err);
      return false;
    }

#if CONFIG_IDF_TARGET_ESP32
    esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
#endif

