mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
    /*
#  if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0) | !defined(CONFIG_NIMBLE_CPP_IDF)
        esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
#   if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32S3)
        bt_cfg.bluetooth_mode = ESP_BT_MODE_BLE;
#   else
        bt_cfg.mode         = ESP_BT_MODE_BLE;
        bt_cfg.ble_max_conn = CONFIG_BT_NIMBLE_MAX_CONNECTIONS;
#   endif

#   ifdef CONFIG_BTDM_BLE_SCAN_DUPL
        bt_cfg.normal_adv_size     = m_scanDuplicateSize;
        bt_cfg.scan_duplicate_type = m_scanFilterMode;
#   endif
        err = esp_bt_controller_init(&bt_cfg);
        if (err != ESP_OK) {
            log_e(LOG_TAG, "esp_bt_controller_init() failed; err=%d", err);
            return false;
        }

        err = esp_bt_controller_enable(ESP_BT_MODE_BLE);
        if (err != ESP_OK) {
            log_e(LOG_TAG, "esp_bt_controller_enable() failed; err=%d", err);
            return false;
        }

        err = esp_nimble_hci_init();
        if (err != ESP_OK) {
            log_e(LOG_TAG, "esp_nimble_hci_init() failed; err=%d", err);
            return false;
        }
#  endif
*/
    nimble_port_init();

    // Setup callbacks for host events
    ble_hs_cfg.reset_cb = BLEDevice::onReset;
    ble_hs_cfg.sync_cb = BLEDevice::onSync;
    ble_hs_cfg.store_status_cb = ble_store_util_status_rr; /*TODO: Implement handler for this*/

    // Set initial security capabilities
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
    ble_hs_cfg.sm_bonding = 0;
    ble_hs_cfg.sm_mitm = 0;
    ble_hs_cfg.sm_sc = 1;
    ble_hs_cfg.sm_our_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
    ble_hs_cfg.sm_their_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    ble_hs_cfg.sm_our_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
    ble_hs_cfg.sm_their_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
#endif

    setDeviceName(deviceName);
    ble_store_config_init();
    nimble_port_freertos_init(BLEDevice::host_task);
  }

  // Wait for host and controller to sync before returning and accepting new tasks
  while (!m_synced) {
    ble_npl_time_delay(1);
  }

  m_initialized = true;  // Set the initialization flag to ensure we are only initialized once.
  return true;
}  // init

/**
 * @brief Shutdown the BLE stack/controller.
 * @param [in] clearAll If true, deletes all server/advertising/scan/client objects after de-initializing.
 * @note If clearAll is true when called all objects created will be deleted and any references to the created objects become invalid.
 * If clearAll is false, the objects will remain and can be used again after re-initializing the stack.
 * If the stack was not already initialized, the objects created can be deleted when clearAll is true with no effect on the stack.
 */
bool BLEDevice::deinit(bool clearAll) {
  int rc = 0;
  if (m_initialized) {
    rc = nimble_port_stop();
    if (rc == 0) {
      nimble_port_deinit();
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
      rc = esp_nimble_hci_and_controller_deinit();
      if (rc != ESP_OK) {
        log_e(LOG_TAG, "esp_nimble_hci_and_controller_deinit() failed with error: %d", rc);
      }
#endif
      m_initialized = false;
      m_synced = false;
    }
  }

  if (clearAll) {
#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
    if (BLEDevice::m_pServer != nullptr) {
      delete BLEDevice::m_pServer;
      BLEDevice::m_pServer = nullptr;
    }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
    if (BLEDevice::m_bleAdvertising != nullptr) {
      delete BLEDevice::m_bleAdvertising;
      BLEDevice::m_bleAdvertising = nullptr;
    }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
    if (BLEDevice::m_pScan != nullptr) {
      delete BLEDevice::m_pScan;
      BLEDevice::m_pScan = nullptr;
    }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
    for (auto clt : m_pClients) {
      deleteClient(clt);
    }
#endif
  }

  return rc == 0;
}  // deinit

/**
 * @brief Check if the initialization is complete.
 * @return true if initialized.
 */
bool BLEDevice::isInitialized() {
  return m_initialized;
}  // getInitialized

/* -------------------------------------------------------------------------- */
/*                             ADDRESS MANAGEMENT                             */
/* -------------------------------------------------------------------------- */

/**
 * @brief Get our device address.
 * @return A BLEAddress object with the currently used address, or a NULL address if not set.
 */
BLEAddress BLEDevice::getAddress() {
  ble_addr_t addr{};
  uint8_t type = m_ownAddrType & 1;  // input must be random or public, odd values are random
  int rc = ble_hs_id_copy_addr(type, addr.val, NULL);
  if (rc != 0) {
    log_e(LOG_TAG, "No address, rc: %d", rc);
  } else {
    addr.type = type;
  }

  return BLEAddress{addr};
}  // getAddress

/**
 * @brief Sets the address type to use.
 * @param [in] type Bluetooth Device address type.
 * The available types are defined as:
 * * 0x00: BLE_OWN_ADDR_PUBLIC - Public address; Uses the hardware static address.
 * * 0x01: BLE_OWN_ADDR_RANDOM - Random static address; Uses the hardware or generated random static address.
 * * 0x02: BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT - Resolvable private address, defaults to public if no RPA available.
 * * 0x03: BLE_OWN_ADDR_RPA_RANDOM_DEFAULT - Resolvable private address, defaults to random static if no RPA available.
 */
bool BLEDevice::setOwnAddrType(uint8_t type) {
  int rc = ble_hs_id_copy_addr(type & 1, NULL, NULL);  // Odd values are random
  if (rc != 0) {
    log_e(LOG_TAG, "Unable to set address type %d, rc=%d", type, rc);
    return false;
  }

  m_ownAddrType = type;

  if (type == BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT || type == BLE_OWN_ADDR_RPA_RANDOM_DEFAULT) {
#ifdef CONFIG_IDF_TARGET_ESP32
    // esp32 controller does not support RPA so we must use the random static for calls to the stack
    // the host will take care of the random private address generation/setting.
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA);
#endif
  } else {
#ifdef CONFIG_IDF_TARGET_ESP32
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_DISABLE_PRIVACY);
#endif
  }

  return rc == 0;
}  // setOwnAddrType

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(const BLEAddress &addr) {
  return setOwnAddr(addr.getBase()->val);
}  // setOwnAddr

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(const uint8_t *addr) {
  int rc = ble_hs_id_set_rnd(addr);
  if (rc != 0) {
    log_e(LOG_TAG, "Failed to set address, rc=%d", rc);
    return false;
  }

