mhpham23/arduino-esp32/libraries/BLE/src/NimBLEDevice.cpp
  return true;
}  // setOwnAddr

/* -------------------------------------------------------------------------- */
/*                                  SECURITY                                  */
/* -------------------------------------------------------------------------- */

/**
 * @brief Set the authorization mode for this device.
 * @param bonding If true we allow bonding, false no bonding will be performed.
 * @param mitm If true we are capable of man in the middle protection, false if not.
 * @param sc If true we will perform secure connection pairing, false we will use legacy pairing.
 */
void BLEDevice::setSecurityAuth(bool bonding, bool mitm, bool sc) {
  log_d(LOG_TAG, "Setting bonding: %d, mitm: %d, sc: %d", bonding, mitm, sc);
  ble_hs_cfg.sm_bonding = bonding;
  ble_hs_cfg.sm_mitm = mitm;
  ble_hs_cfg.sm_sc = sc;
}  // setSecurityAuth

/**
 * @brief Set the authorization mode for this device.
 * @param auth_req A bitmap indicating what modes are supported.\n
 * The available bits are defined as:
 * * 0x01 BLE_SM_PAIR_AUTHREQ_BOND
 * * 0x04 BLE_SM_PAIR_AUTHREQ_MITM
 * * 0x08 BLE_SM_PAIR_AUTHREQ_SC
 * * 0x10 BLE_SM_PAIR_AUTHREQ_KEYPRESS  - not yet supported.
 */
void BLEDevice::setSecurityAuth(uint8_t auth_req) {
  BLEDevice::setSecurityAuth(auth_req & BLE_SM_PAIR_AUTHREQ_BOND, auth_req & BLE_SM_PAIR_AUTHREQ_MITM, auth_req & BLE_SM_PAIR_AUTHREQ_SC);
}  // setSecurityAuth

/**
 * @brief Set the Input/Output capabilities of this device.
 * @param iocap One of the following values:
 * * 0x00 BLE_HS_IO_DISPLAY_ONLY         DisplayOnly IO capability
 * * 0x01 BLE_HS_IO_DISPLAY_YESNO        DisplayYesNo IO capability
 * * 0x02 BLE_HS_IO_KEYBOARD_ONLY        KeyboardOnly IO capability
 * * 0x03 BLE_HS_IO_NO_INPUT_OUTPUT      NoInputNoOutput IO capability
 * * 0x04 BLE_HS_IO_KEYBOARD_DISPLAY     KeyboardDisplay Only IO capability
 */
void BLEDevice::setSecurityIOCap(uint8_t iocap) {
  ble_hs_cfg.sm_io_cap = iocap;
}  // setSecurityIOCap

/**
 * @brief If we are the initiator of the security procedure this sets the keys we will distribute.
 * @param initKey A bitmap indicating which keys to distribute during pairing.\n
 * The available bits are defined as:
 * * 0x01: BLE_SM_PAIR_KEY_DIST_ENC  - Distribute the encryption key.
 * * 0x02: BLE_SM_PAIR_KEY_DIST_ID   - Distribute the ID key (IRK).
 * * 0x04: BLE_SM_PAIR_KEY_DIST_SIGN
 * * 0x08: BLE_SM_PAIR_KEY_DIST_LINK
 */
void BLEDevice::setSecurityInitKey(uint8_t initKey) {
  ble_hs_cfg.sm_our_key_dist = initKey;
}  // setsSecurityInitKey

/**
 * @brief Set the keys we are willing to accept during pairing.
 * @param respKey A bitmap indicating which keys to accept during pairing.
 * The available bits are defined as:
 * * 0x01: BLE_SM_PAIR_KEY_DIST_ENC  -  Accept the encryption key.
 * * 0x02: BLE_SM_PAIR_KEY_DIST_ID   -  Accept the ID key (IRK).
 * * 0x04: BLE_SM_PAIR_KEY_DIST_SIGN
 * * 0x08: BLE_SM_PAIR_KEY_DIST_LINK
 */
void BLEDevice::setSecurityRespKey(uint8_t respKey) {
  ble_hs_cfg.sm_their_key_dist = respKey;
}  // setsSecurityRespKey

/**
 * @brief Set the passkey the server will ask for when pairing.
 * @param [in] passkey The passkey to use.
 */
void BLEDevice::setSecurityPasskey(uint32_t passkey) {
  m_passkey = passkey;
}  // setSecurityPasskey

/**
 * @brief Get the current passkey used for pairing.
 * @return The current passkey.
 */
uint32_t BLEDevice::getSecurityPasskey() {
  return m_passkey;
}  // getSecurityPasskey

/**
 * @brief Start the connection securing and authorization for this connection.
 * @param connHandle The connection handle of the peer device.
 * @param rcPtr Optional pointer to pass the return code to the caller.
 * @returns True if successfully started, success = 0 or BLE_HS_EALREADY.
 */
bool BLEDevice::startSecurity(uint16_t connHandle, int *rcPtr) {
  int rc = ble_gap_security_initiate(connHandle);
  if (rc != 0) {
    log_e(LOG_TAG, "ble_gap_security_initiate: rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
  }
  if (rcPtr) {
    *rcPtr = rc;
  }
  return rc == 0 || rc == BLE_HS_EALREADY;
}  // startSecurity

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL) || defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
/**
 * @brief Inject the provided passkey into the Security Manager.
 * @param [in] peerInfo Connection information for the peer.
 * @param [in] passkey The 6-digit passkey to inject.
 * @return true if the passkey was injected successfully.
 */
bool BLEDevice::injectPassKey(const BLEConnInfo &peerInfo, uint32_t passkey) {
  ble_sm_io pkey{.action = BLE_SM_IOACT_INPUT, .passkey = passkey};
  int rc = ble_sm_inject_io(peerInfo.getConnHandle(), &pkey);
  log_d(LOG_TAG, "BLE_SM_IOACT_INPUT; ble_sm_inject_io result: %d", rc);
  return rc == 0;
}

/**
 * @brief Inject the provided numeric comparison response into the Security Manager.
 * @param [in] peerInfo Connection information for the peer.
 * @param [in] accept Whether the user confirmed or declined the comparison.
 */
bool BLEDevice::injectConfirmPasskey(const BLEConnInfo &peerInfo, bool accept) {
  ble_sm_io pkey{.action = BLE_SM_IOACT_NUMCMP, .numcmp_accept = accept};
  int rc = ble_sm_inject_io(peerInfo.getConnHandle(), &pkey);
  log_d(LOG_TAG, "BLE_SM_IOACT_NUMCMP; ble_sm_inject_io result: %d", rc);
  return rc == 0;
}
#endif  // CONFIG_BT_NIMBLE_ROLE_CENTRAL || CONFIG_BT_NIMBLE_ROLE_PERIPHERAL

/* -------------------------------------------------------------------------- */
/*                                  UTILITIES                                 */
/* -------------------------------------------------------------------------- */

/**
 * @brief Set the BLEDevice name.
 * @param [in] deviceName The name to set.
 */
bool BLEDevice::setDeviceName(const std::string &deviceName) {
  int rc = ble_svc_gap_device_name_set(deviceName.c_str());
  if (rc != 0) {
    log_e(LOG_TAG, "Device name not set - too long");
    return false;
  }

  return true;
}  // setDeviceName

/**
 * @brief Set a custom callback for gap events.
 * @param [in] handler The function to call when gap events occur.
 * @returns
 */
bool BLEDevice::setCustomGapHandler(gap_event_handler handler) {
  int rc = ble_gap_event_listener_register(&m_listener, handler, NULL);
  if (rc == BLE_HS_EALREADY) {
    log_i(LOG_TAG, "Already listening to GAP events.");
    return true;
  } else if (rc != 0) {
    log_e(LOG_TAG, "ble_gap_event_listener_register: rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
  }

  return rc == 0;
}  // setCustomGapHandler

/**
 * @brief Return a string representation of the address of this device.
 * @return A string representation of this device address.
 */
std::string BLEDevice::toString() {
  return getAddress().toString();
}  // toString

#endif  // CONFIG_BT_ENABLED
